var glossary = [{initial:"A", words:[{word:"Administrator" ,desc:"One access permission type under which you can log onto Windows. By logging onto a computer as an adminstrator, you can perform all operations and configure all settings on that computer."},{word:"Alternate driver" ,desc:"A printer driver for client computers that is installed in a print server. An alternate driver can be installed in a client computer via the network."}]},{initial:"C", words:[{word:"Client computer" ,desc:"In this manual, a computer that can use a shared printer connected to a print server via a network."}]},{initial:"D", words:[{word:"Department ID management feature" ,desc:"A function for calculating and managing information via the printer for each of a number of specified groups, such as the number of pages printed etc."},{word:"Device" ,desc:"In this manual, refers to the printer itself."},{word:"Driver" ,desc:"In this manual, refers to the printer driver software."}]},{initial:"F", words:[{word:"Firewall" ,desc:"A security system that prevents unauthorized access of a network such as an in-company LAN from outside. Using the firewall setting function of the machine, you can restrict access so that only computers with specific IP addresses can gain access to data in the machine, increasing security."}]},{initial:"H", words:[{word:"Help" ,desc:"Abbreviations of Online Help."}]},{initial:"I", words:[{word:"Installation" ,desc:"In this manual, copying the files that constitute the printer driver into a computer so that the printer driver can be used."},{word:"Installer" ,desc:"Software for installing, updating, or uninstalling a printer driver."},{word:"IPv4/IPv6" ,desc:"Internet Protocol version 4/Internet Protocol version 6. IPv4 addresses use 32-bit values to distinguish between 2 to the power of 32 (approximately 4.3 billion) unique addresses. IPv6 expands the address values to 128-bit to deal with the emerging problem that the 4.3 billion addresses made available by IPv4 are insufficient to cope with the spread of information technology, and to solve other problems with IPv4. The 128-bit addresses of IPv6 provide 2 to the power of 128 addresses, giving a virtually unlimited supply of unique addresses."}]},{initial:"L", words:[{word:"Local" ,desc:"In this manual, the computer/printer environment where the components are at hand, as distinct from a network environment."},{word:"Log on" ,desc:"Entering a user name and password as a means of user authentication to start a computer session or gain access to a service."}]},{initial:"O", words:[{word:"Online help" ,desc:"A document  that can be displayed on the computer screen describing how to use software. In the printer driver, by clicking on the [Help] button in a window, you can access online help items corresponding to the displayed window."}]},{initial:"P", words:[{word:"Page Description Language " ,desc:"A language for describing a print image consisting of letters, graphics, etc. when printing a document created on a computer."},{word:"Port" ,desc:"A pathway into and out of a computer for the computer to communicate with the outside. When using a printer from a computer, data is transmitted through the printer port."},{word:"Print server" ,desc:"A computer that is set so that other computers can use a printer that is connected to it."},{word:"Printer driver" ,desc:"Software for controlling functions and printing from a printer using a computer. To use the printer driver, install it in the computer."},{word:"Protocol" ,desc:"A set of rules that govern the transmission of data across a network. Examples of protocols are FTP, DHCP, BOOTP, RARP, IPP, TCP/IP, SSL, and LDAP."}]},{initial:"R", words:[{word:"README" ,desc:"A file that accompanies the software. It contains instructions on how to use the software, cautions, warnings, limitations and restrictions."}]},{initial:"S", words:[{word:"Shared printer" ,desc:"A printer that is set so that it can be used by multiple computers via a network. Compared to a locally connected printer, you can configure printer settings on a computer that are shared and can be used by other computers."},{word:"Sleep mode" ,desc:"A standby state of a computer or printer that reduces the amount of power being used. Operations can be resumed in a shorter time than if the power is turned off."},{word:"Subnet" ,desc:"A portion of a network, which may be a physically independent network segment, that shares a network address with other portions of the network, and is distinguished by a subnet number. For example, all devices with IP addresses that start with 255.255.255. would be part of the same subnet."}]},{initial:"T", words:[{word:"TCP/IP" ,desc:"Transmission Control Protocol/Internet Protocol. The protocol used to connect to the Internet and wide area networks."}]},{initial:"U", words:[{word:"UFR II" ,desc:"Ultra Fast Rendering II. A printing algorithm for realizing high speed rendering. UFR II enables processing tasks to be executed and divided appropriately between the host PC and the printer to greatly reduce overall printing time."},{word:"Uninstallation" ,desc:"In this manual, deleting an installed driver from a computer when it is no longer required."},{word:"Updating" ,desc:"In this manual, bringing an already installed driver up to date."},{word:"USB" ,desc:"Abbreviation of Universal Serial Bus. A common standard for connecting peripheral devices to computers by cable. You can also connect printers to computers by USB (this may require an optional interface board, depending on the printer model you are using)."},{word:"USB class driver" ,desc:"Software for controlling peripheral devices connected to a computer by USB. USB-compatible peripheral devices are divided into groups known as \"classes\" according to their functions, with peripheral devices of the same class able to use the same USB class driver."},{word:"USB interface board" ,desc:"An optional expansion board for USB connections. Depending on the printer model, USB connections may not be supported in the standard configuration, requiring an optional USB interface board for the printer to connect via USB."}]},{initial:"W", words:[{word:"WSD" ,desc:"Abbreviation of Web Services on Devices. A standard for discovering computers and peripheral devices on a network. A printer that supports WSD and is connected to a network can automatically be found in Windows versions from Windows Vista onward."}]},{initial:"X", words:[{word:"XPS" ,desc:"Abbreviation of XML Paper Specification. It is an XML-based specification for a page description language developed by Microsoft. Using an XPS printer driver with Windows Vista and later operating systems, a user can make use of the maximum number of XPS features when printing from an application that supports the XPS specification."}]}];